In [1]:
import mysql.connector
from mysql.connector import Error
import pandas as pd

# CREATE CONNECTION

In [3]:
def create_server_connection(host_name, user_name, user_password):
    connection = None
    try:
        connection = mysql.connector.connect(host = host_name,user = user_name, passwd = user_password)
        print("MySQL server connection successful.")
    except Error as err :
        print(f"Error : '{err}'")
    return connection

In [4]:
pw = "*******"
db = 'girrafe'

In [5]:
connection = create_server_connection("localhost", "root",pw)

MySQL server connection successful.

# create database / execute any query

In [7]:
def create_database(connection,query):
    cursor = connection.cursor()
    try :
        cursor.execute(query)
        print("database creation was successfull")
    except Error as err:
        print(f"Error : '{err}'")

In [11]:
create_database_mysql_python = "CREATE DATABASE mysql_python"
create_database(connection,create_database_mysql_python)

Error : '1007 (HY000): Can't create database 'mysql_python'; database exists'

# Create DB connection

In [13]:
def create_dbconnection(host_name, user_name, user_password, db_name):
    connection = None
    try :
        connection = mysql.connector.connect(host = host_name, user = user_name, passwd = user_password, database = db_name)
        print(f"databse connection to {db_name} successfull.")
    except Error as err:
        print(f"Error : '{err}'")
    return connection

In [15]:
create_dbconnection("localhost","root", pw, "mysql_python")

databse connection to mysql_python successfull.

# EXECUTE QUERY

In [19]:
def execute_query(connection,query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        print("query successful")
    except Error as err:
        print(f"Error : {err}")

In [20]:
create_table_employees = """
Create table employees(
EmpID INT NOT NULL PRIMARY KEY AUTO_INCREMENT,
EmpName varchar(20) ,
age int ,
gender char(1),
doj date,
dept varchar(25),
city varchar(25),
salary float(2),
CHECK (GENDER IN ('M','F'))
);
"""

In [21]:
execute_query(connection, create_table_employees)

query successful

In [23]:
insert_data_employees = """
INSERT INTO EMPLOYEES(EMPNAME, AGE, GENDER, DOJ, DEPT, CITY, SALARY)
VALUES
("KENNY", 22, "F", '2020-02-22', 'SALES','CHENNAI',23000),
("RONAK", 28, "M", '2010-04-12', 'PD','MUMBAI',33000),
("JENNY", 23, "F", '2022-03-03', 'ANALYTICS','PUNE',27000),
("KEMAA", 25, "F", '2018-06-06', 'SALES','CHENNAI',23000),
("SUMAN", 30, "M", '2020-01-11', 'SALES','DELHI',33000),
("MEHEK", 21, "F", '2010-02-22', 'MFG','CHENNAI',23000),
("KAMAL", 22, "M", '2018-02-22', 'MFG','DELHI',43000),
("NEHAL", 35, "M", '2010-02-22', 'MFG','CHENNAI',23000),
("NEHA", 40, "F", '2020-02-22', 'ANALYTICS','DELHI',63000),
("NILAM", 30, "F", '2020-02-22', 'ANALYTICS','CHENNAI',23000),
("AMIT", 26, "M", '2013-01-04', 'ANALYTICS','DELHI',63000),
("MONIKA", 23, "F", '2021-10-02', 'SALES','CHENNAI',53000),
("JAGRUTI", 20, "F", '2018-07-24', 'SERVICE','DELHI',43000),
("ANJALI", 29, "F", '2015-06-12', 'SERVICE','PUNE',83000),
("SOHAM", 26, "M", '2014-04-28', 'SERVICE','MUMBAI',53000),
("KEVAL", 22, "M", '2019-02-22', 'SERVICE','PUNE',73000),
("CHETAN", 24, "M", '2022-09-11', 'PD','CHENNAI',83000),
("RAM", 22, "M", '2022-07-17', 'PD','PUNE',73000),
("SEJAL", 27, "F", '2017-03-26', 'PD','CHENNAI',63000),
("SONAL", 32, "F", '2015-08-03', 'PD','CHENNAI',53000),
("MONA", 35, "F", '2010-12-29', 'SALES','BANGALORE',73000),
("PUJA", 23, "F", '2007-05-04', 'SALES','DELHI',53000);

"""

In [25]:
execute_query(connection, insert_data_employees)

query successful

# Read query

In [26]:
def read_query(conection, query):
    try :
        cursor = connection.cursor()
        cursor.execute(query)
        result = cursor.fetchall()
        return result 
    except Error as err :
        print(f"Error : {err}")

In [30]:
q1 = "SELECT * FROM EMPLOYEES"
result = read_query(connection,q1)
for r in result:
    print(r)

(1, 'KENNY', 22, 'F', datetime.date(2020, 2, 22), 'SALES', 'CHENNAI', 23000.0)
(2, 'RONAK', 28, 'M', datetime.date(2010, 4, 12), 'PD', 'MUMBAI', 33000.0)
(3, 'JENNY', 23, 'F', datetime.date(2022, 3, 3), 'ANALYTICS', 'PUNE', 27000.0)
(4, 'KEMAA', 25, 'F', datetime.date(2018, 6, 6), 'SALES', 'CHENNAI', 23000.0)
(5, 'SUMAN', 30, 'M', datetime.date(2020, 1, 11), 'SALES', 'DELHI', 33000.0)
(6, 'MEHEK', 21, 'F', datetime.date(2010, 2, 22), 'MFG', 'CHENNAI', 23000.0)
(7, 'KAMAL', 22, 'M', datetime.date(2018, 2, 22), 'MFG', 'DELHI', 43000.0)
(8, 'NEHAL', 35, 'M', datetime.date(2010, 2, 22), 'MFG', 'CHENNAI', 23000.0)
(9, 'NEHA', 40, 'F', datetime.date(2020, 2, 22), 'ANALYTICS', 'DELHI', 63000.0)
(10, 'NILAM', 30, 'F', datetime.date(2020, 2, 22), 'ANALYTICS', 'CHENNAI', 23000.0)
(11, 'AMIT', 26, 'M', datetime.date(2013, 1, 4), 'ANALYTICS', 'DELHI', 63000.0)
(12, 'MONIKA', 23, 'F', datetime.date(2021, 10, 2), 'SALES', 'CHENNAI', 53000.0)
(13, 'JAGRUTI', 20, 'F', datetime.date(2018, 7, 24), 'SERVICE', 'DELHI', 43000.0)
(14, 'ANJALI', 29, 'F', datetime.date(2015, 6, 12), 'SERVICE', 'PUNE', 83000.0)
(15, 'SOHAM', 26, 'M', datetime.date(2014, 4, 28), 'SERVICE', 'MUMBAI', 53000.0)
(16, 'KEVAL', 22, 'M', datetime.date(2019, 2, 22), 'SERVICE', 'PUNE', 73000.0)
(17, 'CHETAN', 24, 'M', datetime.date(2022, 9, 11), 'PD', 'CHENNAI', 83000.0)
(18, 'RAM', 22, 'M', datetime.date(2022, 7, 17), 'PD', 'PUNE', 73000.0)
(19, 'SEJAL', 27, 'F', datetime.date(2017, 3, 26), 'PD', 'CHENNAI', 63000.0)
(20, 'SONAL', 32, 'F', datetime.date(2015, 8, 3), 'PD', 'CHENNAI', 53000.0)
(21, 'MONA', 35, 'F', datetime.date(2010, 12, 29), 'SALES', 'BANGALORE', 73000.0)
(22, 'PUJA', 23, 'F', datetime.date(2007, 5, 4), 'SALES', 'DELHI', 53000.0)

# show using pandas

In [31]:
from_db = []

In [32]:
for r in result:
    r = list(r)
    from_db.append(r)
columns = ["EmpID", "EmpName", "Age", "gender", "doj", "dept","city", "salary"]
df = pd.DataFrame(from_db, columns = columns)

display(df)

    EmpID  EmpName  Age gender         doj       dept       city   salary
0       1    KENNY   22      F  2020-02-22      SALES    CHENNAI  23000.0
1       2    RONAK   28      M  2010-04-12         PD     MUMBAI  33000.0
2       3    JENNY   23      F  2022-03-03  ANALYTICS       PUNE  27000.0
3       4    KEMAA   25      F  2018-06-06      SALES    CHENNAI  23000.0
4       5    SUMAN   30      M  2020-01-11      SALES      DELHI  33000.0
5       6    MEHEK   21      F  2010-02-22        MFG    CHENNAI  23000.0
6       7    KAMAL   22      M  2018-02-22        MFG      DELHI  43000.0
7       8    NEHAL   35      M  2010-02-22        MFG    CHENNAI  23000.0
8       9     NEHA   40      F  2020-02-22  ANALYTICS      DELHI  63000.0
9      10    NILAM   30      F  2020-02-22  ANALYTICS    CHENNAI  23000.0
10     11     AMIT   26      M  2013-01-04  ANALYTICS      DELHI  63000.0
11     12   MONIKA   23      F  2021-10-02      SALES    CHENNAI  53000.0
12     13  JAGRUTI   20      F  2018-07-24    SERVICE      DELHI  43000.0
13     14   ANJALI   29      F  2015-06-12    SERVICE       PUNE  83000.0
14     15    SOHAM   26      M  2014-04-28    SERVICE     MUMBAI  53000.0
15     16    KEVAL   22      M  2019-02-22    SERVICE       PUNE  73000.0
16     17   CHETAN   24      M  2022-09-11         PD    CHENNAI  83000.0
17     18      RAM   22      M  2022-07-17         PD       PUNE  73000.0
18     19    SEJAL   27      F  2017-03-26         PD    CHENNAI  63000.0
19     20    SONAL   32      F  2015-08-03         PD    CHENNAI  53000.0
20     21     MONA   35      F  2010-12-29      SALES  BANGALORE  73000.0
21     22     PUJA   23      F  2007-05-04      SALES      DELHI  53000.0